


# -----------------------------------------------------------------------------
# BROWSERS & INTERNET
# -----------------------------------------------------------------------------

cask "firefox"
cask "google-chrome"
cask "tor-browser"
cask "tunnelblick"
cask "vivaldi"
# cask "brave-browser"
# cask "microsoft-edge"
# cask "orion"



# -----------------------------------------------------------------------------
# PRODUCTIVITY & OFFICE
# -----------------------------------------------------------------------------

cask "calibre"
cask "drawio"
cask "linear-linear"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "obsidian"
cask "raycast"
cask "setapp"
cask "sublime-text"
cask "claude"
cask "homerow"
# cask "alt-tab"
# cask "contexts"
# cask "fantastical"
# cask "macdown"



# -----------------------------------------------------------------------------
# COMMUNICATION & SOCIAL
# -----------------------------------------------------------------------------

cask "discord"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "zoom"



# -----------------------------------------------------------------------------
# MEDIA & ENTERTAINMENT
# -----------------------------------------------------------------------------

cask "audacity"
cask "gimp"
cask "google-earth-pro"
cask "iina"
cask "obs"
cask "spotify"
cask "steam"
cask "vlc"
# cask "inkscape"
# cask "shadow"



# -----------------------------------------------------------------------------
# FILE MANAGEMENT & STORAGE
# -----------------------------------------------------------------------------

cask "electrum"
cask "google-drive"
cask "imageoptim"
cask "keka"
cask "veracrypt"
brew "ipfs"
# cask "bisq"
# cask "cyberduck"
# cask "dropbox"
# cask "omnidisksweeper"



# -----------------------------------------------------------------------------
# SYSTEM UTILITIES
# -----------------------------------------------------------------------------

cask "hammerspoon"
cask "hyperkey"
# cask "karabiner-elements"
# cask "lulu"



# -----------------------------------------------------------------------------
# DEVELOPMENT - TERMINALS & SHELLS
# -----------------------------------------------------------------------------

cask "ghostty"
cask "iterm2"
cask "wezterm"
# cask "alacritty"
# cask "kitty"



# -----------------------------------------------------------------------------
# DEVELOPMENT - EDITORS & IDEs
# -----------------------------------------------------------------------------

brew "neovim"
cask "cursor"
cask "visual-studio-code"

brew "sst/tap/opencode"


# -----------------------------------------------------------------------------
# DEVELOPMENT - DATABASES & APIS
# -----------------------------------------------------------------------------

cask "bruno" # api client - trialing
cask "insomnia" # api client - trialing
cask "redisinsight"
# cask "dbeaver-community"



# -----------------------------------------------------------------------------
# DEVELOPMENT - CONTAINERS & VIRTUALIZATION
# -----------------------------------------------------------------------------

cask "docker"
cask "orbstack"
brew "lazydocker"



# -----------------------------------------------------------------------------
# DEVELOPMENT - VERSION CONTROL
# -----------------------------------------------------------------------------

brew "gh"
brew "git-lfs"
brew "gitleaks"
brew "jesseduffield/lazygit/lazygit"



# -----------------------------------------------------------------------------
# DEVELOPMENT - LANGUAGES & RUNTIMES
# -----------------------------------------------------------------------------

brew "deno"
brew "mise"
# brew "asdf"
brew "oven-sh/bun/bun"
# brew "pnpm" # consider using corepack



# -----------------------------------------------------------------------------
# DEVELOPMENT - CLOUD & INFRASTRUCTURE
# -----------------------------------------------------------------------------

brew "ariga/tap/atlas"
brew "siderolabs/tap/talosctl"
brew "hasura-cli"
brew "tfenv" # terraform version manager
# brew "awscli"
# brew "CrunchyData/brew/cb"
# brew "hashicorp/tap/terraform"
# brew "rover"
# brew "stripe/stripe-cli/stripe"
# cask "google-cloud-sdk"



# -----------------------------------------------------------------------------
# DEVELOPMENT - FONTS
# -----------------------------------------------------------------------------

cask "font-jetbrains-mono-nerd-font"


# -----------------------------------------------------------------------------
# CLI TOOLS - CORE UTILITIES
# -----------------------------------------------------------------------------

brew "bat"
brew "colordiff" # trialing
brew "difftastic"
brew "eza"
brew "fd"
brew "fzf"
brew "gnu-sed"
brew "moreutils"
brew "ripgrep"
brew "tldr"
brew "watch"
brew "wget"
brew "zoxide"
brew "zsh-history-substring-search"
brew "gnupg"
# brew "tree"



# -----------------------------------------------------------------------------
# CLI TOOLS - FILE MANAGEMENT
# -----------------------------------------------------------------------------

brew "age"
brew "clamav"
brew "cloc"
brew "duf" # disk usage - trialing
brew "dust" # disk usage - trialing
brew "ncdu" # disk usage - trialing
brew "p7zip"
brew "rclone"
brew "restic"
brew "rsync"
brew "unar" # unarchive - trialing
brew "yazi"
# brew "midnight-commander"
# brew "broot"
# brew "ranger"
# brew "shred"



# -----------------------------------------------------------------------------
# CLI TOOLS - DATA PROCESSING
# -----------------------------------------------------------------------------

brew "fx"
brew "jq"
brew "miller"
brew "saulpw/vd/visidata"
brew "yq"
# brew "csvtk"
# brew "htmlq"
# brew "sc-im"
# brew "xsv"



# -----------------------------------------------------------------------------
# CLI TOOLS - MONITORING & PERFORMANCE
# -----------------------------------------------------------------------------

brew "btop"
brew "fastfetch"
# brew "dog"
# brew "doggo"
# brew "speedtest-cli" # can use `networkQuality -v` instead



# -----------------------------------------------------------------------------
# CLI TOOLS - MEDIA & CONVERSION
# -----------------------------------------------------------------------------

brew "exiftool" # trialing yazi dependency"
brew "ffmpeg"
brew "ffmpegthumbnailer" # trialing yazi dependency"
brew "imagemagick"
brew "poppler" # trialing yazi dependency"
brew "qrencode"



# -----------------------------------------------------------------------------
# DEVELOPMENT - NETWORKING & DEBUGGING
# -----------------------------------------------------------------------------

brew "mailsy"
brew "mitmproxy"
brew "navi"
cask "ngrok"
brew "pam-reattach"
brew "watchman"
cask "charles"
# brew "http-server # using http-serve from prezto instead"
# brew "pjproject"



# -----------------------------------------------------------------------------
# UI CUSTOMIZATION
# -----------------------------------------------------------------------------

brew "FelixKratz/formulae/sketchybar"
# brew "koekeishiya/formulae/skhd"
# brew "koekeishiya/formulae/yabai"
# brew "stats"
# cask "amethyst"
# cask "ubersicht"



